app/controllers/api/v1/users_controller.rb

  def show
    respond_with User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def create
  	user = User.new(user_params)
  	if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('pop@me.com', '$2a$10$MMykaGO03577hnuNJuxmQOoMLImE/3P0VLEgZ0PCTWHZ.WxB.Lj5G', '2017-07-14 22:10:30', '2017-07-14 22:10:40')

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `email` = 'frank@gmail.com', `encrypted_password` = '$2a$10$Gh5IZzFgPWYO2Lo0pLHk6OZM79RpiJhOhtl0tlfKSYXgPtqMSdUty', `updated_at` = '2017-07-21 01:45:03' WHERE `users`.`id` = 2

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3